Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: You can now set C<-W> from the C<PERL5OPT> environment variable
es_es: Ahora puede establecer C<-W> desde la variable de entorno C<PERL5OPT>

source: 3.14); # same as @list = (2 ..
es_es: 3.14); # lo mismo que @lista = (2 ..

source: The F<dprofpp> utility analyzes the output of this profiler and tells you which subroutines are taking up the most run time.
es_es: La utilidad F<dprofpp> analiza los resultados del perfilador e indica cuáles son las subrutinas que consumen más tiempo.

source: Returns the empty list if C<stat> fails.
es_es: Devuelve la lista vacía si C<stat> falla.

source: The complete Perl documentation is available with the Perl distribution.
es_es: La distribución de Perl incluye la documentación completa de Perl.

source: $other_execute = $mode & S_IXOTH;
es_es: $otros_ejecutar = $modo & S_IXOTH;

source: Such a scheme is sometimes preferable to matching particular string values of C<$@> with regular expressions.
es_es: Tal esquema es algunas veces preferible a emparejar ciertas cadenas de valores de C<$@> usando expresiones regulares.

source: undef $bar{'blurfl'}; # Compare to: delete $bar{'blurfl'};
es_es: undef $bar{'blurfl'}; # Comparar a: delete $bar{'blurfl'};

source: Otherwise, C<L<use locale|perllocale>> sets the default modifier to C</l>; and C<L<use feature 'unicode_strings|feature>> or C<L<use 5.012|perlfunc/use VERSION>> (or higher) set the default to C</u> when not in the same scope as either C<L<use locale|perllocale>> or C<L<use bytes|bytes>>.
es_es: De lo contrario, C<L<use locale|perllocale>> establece el modificador por defecto a C</l>; y C<L<use feature 'unicode_strings|feature>> o C<L<use 5.012|perlfunc/use VERSION>> (o superior) establece el valor por defecto a C</u> cuando no estén en el mismo ámbito, tanto si está C<L<use locale|perllocale>> o C<L<use bytes|bytes>>.

source: A named array in scalar context is quite different from what would at first glance appear to be a list in scalar context.
es_es: Un array con nombre, en contexto escalar, es muy diferente de lo que en un primer vistazo pudiera ser una lista en contexto escalar.

source: chmod($perm | 0600, $fh);
es_es: chmod($permisos | 0600, $fh);

source: Provide a README file and perhaps also release notes, changelog, etc
es_es: Proporcione un archivo README y quizás también notas de la versión, de cambios, etc

source: Because this operator produces an assignable result, using assignments without parentheses will get you in trouble.
es_es: Debido a que este operador produce un resultado asignable, usar asignaciones sin paréntesis hará que se meta en problemas.

source: Undefines the value of EXPR, which must be an lvalue.
es_es: Indefine el valor de EXPR, que debe ser un I<ivalor>.

source: \K [6] Keep the stuff left of the \K, don't include it in $&
es_es: \K [6] Olvidar lo que está a la izquierda de \K, no incluir en $&

source: $time = (stat($file))[8];
es_es: $acceso = (stat($archivo))[8];

source: To reiterate, this modifier provides protection for applications that don't wish to be exposed to all of Unicode.
es_es: Repetimos, este modificador proporciona protección para las aplicaciones que no quieran estar expuestas a todo el Unicode.

source: If C<do> can read the file but cannot compile it, it returns C<undef> and sets an error message in C<$@>.
es_es: Si C<do> puede leer el archivo pero no puede compilarlo, devuelve C<undef> y pone un mensaje de error en C<$@>.

source: (If you put a space it will be treated as a null identifier, which is valid, and matches the first empty line.) The terminating string must appear by itself (unquoted and with no surrounding whitespace) on the terminating line.
es_es: (Si pone un espacio será tratado como un identificador nulo, que es válido, y coincide con la primera línea en blanco). La cadena de terminación debe aparecer a sí mismo (sin comillas y sin espacios en blanco que la rodee) en la línea de terminación.

source: The actual random order is subject to change in future versions of Perl, but it is guaranteed to be the same order as either the C<values> or C<each> function produces (given that the hash has not been modified).
es_es: El actual orden aleatorio está sujeto a cambio en futuras versiones de Perl, pero se garantiza que sea el mismo orden que las funciones C<values> o C<each> producirían (mientras que el hash no haya sido modificado).

source: + prefix non-negative number with a plus sign
es_es: + prefija un número no negativo con un signo más

source: when (\&complicated_check) {
es_es: when (\&confirmacion_complicada) {

source: When using look-ahead assertions and negations, this can all get even trickier.
es_es: Cuando se utiliza con aserciones consecuentes y negaciones, todo esto puede ser incluso aún más complicado.

source: For example, C<0666 & ~027> is 0640.
es_es: Por ejemplo, C<0666 & ~027> es 0640.

source: Binary "|" returns its operands ORed together bit by bit.
es_es: Binario "|" devuelve la operación OR, bit a bit, de sus operandos.

source: =head2 I/O Operators X<operator, i/o> X<operator, io> X<io> X<while> X<filehandle> X<< <> >> X<@ARGV>
es_es: =head2 Operadores E/S X<operator, i/o> X<operator, io> X<io> X<while> X<filehandle> X<< <> >> X<@ARGV> X<operador, e/s> X<operador>

source: perlgit Using git with the Perl repository
es_es: perlgit Usando git con el repositorio de Perl

source: (?= $ | \s ) # in front of end-of-string or whitespace
es_es: (?= $ | \s ) # delante de un final-de-cadena o espacio en blanco

source: The C<continue> block, if any, is not executed.
es_es: El bloque C<continue>, si está, no es ejecutado:

source: perl5123delta - what is new for perl v5.12.3
es_es: perl5123delta - qué hay de nuevo en perl v5.12.3

source: When used as an lvalue, specifying a substring that is entirely outside the string raises an exception.
es_es: Cuando se utiliza como un I<ivalor>, especificando una subcadena que está totalmente fuera de la cadena lanza una excepción.

source: See the example in L<perlipc/"Sockets: Client/Server Communication">.
es_es: Ver el ejemplo en L<perlipc/"Sockets: Comunicación Cliente/Servidor">.

source: if (exists &{$ref->{A}{B}{$key}}) { }
es_es: if (exists &{$ref->{A}{B}{$clave}}) { }

source: 1 - empty hashes or arrays will match.
es_es: 1 - hash o array vacíos coincidirán.

source: When writing, if STRING is too long, only SIZE bytes are used; if STRING is too short, nulls are written to fill out SIZE bytes.
es_es: Al escribir, si CADENA es demasiado larga, sólo se utilizan TAMAÑO bytes; si CADENA es demasiado corta, se escriben nulos para llenar TAMAÑO bytes.

source: =item lc EXPR X<lc> X<lowercase>
es_es: =item lc EXPR X<lc> X<lowercase> X<minúscula>

source: To refer to the current contents of a group later on, within the same pattern, use C<\g1> (or C<\g{1}>) for the first, C<\g2> (or C<\g{2}>) for the second, and so on.
es_es: Para hacer referencia más tarde a los contenidos actuales de un grupo de captura, dentro del mismo patrón, use C<\g1> (o C<\g{1}>) para el primero, C<\g2> (o C<\g{2}>) para el segundo, y así sucesivamente.

source: open(my $dbase, "+<dbase.mine") # ditto
es_es: open(my $dbase, "+<dbase.mine") # lo mismo

source: display_year();
es_es: muestra_año();

source: A question mark was chosen for this and for the minimal-matching construct because 1) question marks are rare in older regular expressions, and 2) whenever you see one, you should stop and "question" exactly what is going on.
es_es: Un signo de interrogación fue elegido para esto y para la construcción mínima de coincidencia porque: 1) signos de interrogación son poco frecuentes en expresiones regulares antiguas, y 2) cada vez que veas uno, debe pararse y "cuestionarse" exactamente lo que está pasando.

source: =head2 Switch statement changes
es_es: =head2 Cambios en la instrucción Switch

source: In the shell, type
es_es: En el shell, escriba

source: See also L</undef>, L</exists>, L</ref>.
es_es: Ver también L</undef>, L</exists>, L</ref>.

source: Concatenation now works correctly when C<use bytes;> is in scope.
es_es: La concatenación funciona ahora correctamente cuando el C<use bytes;> está activo en el ámbito actual.

source: Since Perl may compile the pattern at the moment of execution of the qr() operator, using qr() may have speed advantages in some situations, notably if the result of qr() is used standalone:
es_es: Debido a que Perl puede compilar el patrón en el momento de la ejecución del operador qr(), usarlo puede tener ventajas de velocidad en algunas situaciones, notablemente si el resultado de qr() se utiliza de forma independiente:

source: By default, Perl assumes that it must do most of its arithmetic in floating point.
es_es: De forma predeterminada, Perl se supone que debe hacer la mayor parte de su aritmética en punto flotante.

source: print $@ if $@; # prints "bar lives here"
es_es: print $@ if $@; # imprime "bar vive aquí"

source: =item Numeric comparison
es_es: =item Comparación numérica

source: The text is ignored.
es_es: El texto es ignorado.

source: Not all methods indicated above need be implemented.
es_es: No todos los métodos indicados es necesario implementarlos.

source: Binary ">=" returns true if the left argument is numerically greater than or equal to the right argument.
es_es: Binario ">=" devuelve verdadero si el argumento de la izquierda es numéricamente mayor o igual que el argumento de la derecha.

source: =head3 Differences from Perl 6
es_es: =head3 Diferencias con Perl 6

source: Currently implemented pragmas are:
es_es: Las pragmas actualmente implementadas son:

source: my @files;
es_es: my @archivos;

source: The perlfunc(1) entry on C<umask> discusses the choice of MASK in more detail.
es_es: La entrada perlfunc(1) sobre C<umask> discute la elección de la máscara con más detalles.

source: =head2 Version 8 Regular Expressions X<regular expression, version 8> X<regex, version 8> X<regexp, version 8>
es_es: =head2 Expresiones regulares versión 8 X<regular expression, version 8> X<regex, version 8> X<regexp, version 8> X<expresión regular, versión 8> X<regex, versión 8> X<regexp, versión 8>

source: You can find out whether your Perl supports quads via L<Config>:
es_es: Puede averiguar si su Perl soporta quads a través de L<Config>:

source: warn "\$foo is alive and $foo!"; # does show up
es_es: warn "\$foo está vivo y $foo!"; # lo muestra

source: The numbers refer to the Perl repository change numbers; see L<Changes58> (or L<Changes> in Perl 5.8.1).
es_es: Los números se refieren a los números de cambio en el repositorio Perl; vea L<Changes58> (o L<Cambios> en Perl 5.8.1).

source: =head2 Slices X<slice> X<array, slice> X<hash, slice>
es_es: =head2 Porciones X<slice> X<array, slice> X<hash, slice> X<porción> X<array, porción> X<hash, porción>

source: C<alarm>, C<exec>, C<fork>, C<getpgrp>, C<getppid>, C<getpriority>, C<kill>, C<pipe>, C<qx//>, C<setpgrp>, C<setpriority>, C<sleep>, C<system>, C<times>, C<wait>, C<waitpid>
es_es: C<alarm>, C<exec>, C<fork>, C<getpgrp>, C<getppid>, C<getpriority>, C<kill>, C<pipe>, C<qx/STRING/>, C<setpgrp>, C<setpriority>, C<sleep>, C<system>, C<times>, C<wait>, C<waitpid>

source: On ASCII platforms, this means that the code points between 128 and 255 take on their Latin-1 (ISO-8859-1) meanings (which are the same as Unicode's), whereas in strict ASCII their meanings are undefined.
es_es: En plataformas ASCII significa que los puntos de código entre 128 y 255 toman sus significados desde el Latin-1 (ISO-8859-1) (que son los mismos que los de Unicode), mientras que en un ASCII estricto sus significados no están definidos.

source: For example to define a "systell" function:
es_es: Por ejemplo, para definir una función "systell":

source: See L<PerlIO>, L<perlrun>, and the discussion about the PERLIO environment variable.
es_es: Ver L<PerlIO>, L<perlrun> y la discusión sobre la variable de entorno PERLIO.

# open(ARTICLE) or die "Can't find article $ARTICLE: $! ";
source: open(ARTICLE) or die "Can't find article $ARTICLE: $!\n";
es_es: open(ARTICULO) or die "No puedo encontrar el artículo $ARTICULO: $!\n";

source: Binary "!~" with a non-destructive substitution (s///r) or transliteration (y///r) is a syntax error.
es_es: Binario "!~" con una sustitución no destructiva (s///r) o transliteración (y///r) es un error sintáctico.

source: =head2 Integer Arithmetic X<integer>
es_es: =head2 Aritmética entera X<integer> X<entero>

source: If another branch in the inner parentheses was matched, such as in the string 'ACDE', then the C<D> and C<E> would have to be matched as well.
es_es: Si coincide otra rama en el paréntesis más interior, como en el caso de la cadena 'ACDE', entonces la C<D> y C<E> también tendrían que coincidir.

source: I've replaced fork()/exec() with spawn() and the standalone exec() with spawn().
es_es: He reemplazado fork()/exec() y el solitario exec() con spawn().

source: Authors of similar modules, or modules with similar names, may be a good place to start.
es_es: Los autores de los módulos similares, o módulos con nombres similares, puede ser un buen lugar para comenzar.

source: In the one- and two-argument forms of the call, the mode and filename should be concatenated (in that order), preferably separated by white space.
es_es: En las formas de la llamada de uno y de dos argumentos, el modo y el nombre del archivo debe ser concatenados (en ese orden), preferiblemente separados por espacio en blanco.

source: Starting with Perl 5.14, C<unshift> can take a scalar EXPR, which must hold a reference to an unblessed array.
es_es: A partir de Perl 5.14, C<unshift> puede tomar una EXPR escalar, que debe contener la referencia a un hash o un array no bendecido.

source: when (/apples?/) { say "I like apples."
es_es: when (/manzanas?/) { say "Me gustan las manzanas."

source: You can actually chomp anything that's an lvalue, including an assignment:
es_es: Puede recortar cualquier cosa que sea un lvalue (valor a la izquierda), incluyendo una asignación:

source: A numeric repeat count may optionally be enclosed in brackets, as in C<pack("C[80]", @arr)>.
es_es: Un número de repeticiones podría estar opcionalmente encerrada entre paréntesis, como en C<pack("C[80]", @arr)>.

source: will now imply:
es_es: ahora implicará:

source: (If C<use locale> is set, then this depends on the current locale.) Today it is more common to use the quotemeta() function or the C<\Q> metaquoting escape sequence to disable all metacharacters' special meanings like this:
es_es: (Si C<use locale> está establecido, entonces esto depende de la localización actual). Hoy es más común el uso de la función quotemeta() o de la secuencia de escapado C<\Q> para desactivar los significados especiales de los metacaracteres, como esto:

source: Always check C<$@> first, as compilation could fail in a way that also sets C<$!>.
es_es: Siempre revise C<$@> en primer lugar, la compilación puede fallar de una manera que también actualice C<$!>.

source: =head2 List value constructors X<list>
es_es: =head2 Constructores de lista de valores X<list> X<lista>

source: Documentation enhancements
es_es: Mejoras en la documentación

source: This has been fixed [RT #49003].
es_es: Esto ha sido corregido [RT #49003].

source: README.hurd - Perl version 5 on Hurd
es_es: README.hurd - Perl versión 5 sobre Hurd

source: You can put a C<+> in front of the C<< > >> or C<< < >> to indicate that you want both read and write access to the file; thus C<< +< >> is almost always preferred for read/write updates--the C<< +> >> mode would clobber the file first.
es_es: Puede poner un C<+> en frente de C<< > >> o C<< < >> para indicar que desea acceder al archivo tanto en lectura como en escritura; así, C<< +< >> casi siempre es la forma preferida para la lectura/escritura de actualizaciones -el modo C<< +> >> primero sobreescribirá el archivo-.

source: Nicholas Clark created the pluggable interface, refactored Brandon's implementation to work with it, and wrote this document.
es_es: Nicholas Clark creó el interfaz enchufable, la implementación refactorizada de Brandon para trabajar con él, y escribió este documento.

source: Many memory leaks have been fixed.
es_es: Muchas fugas de memoria han sido corregidas.

source: name => "wibble",
es_es: nombre => "wibble",

source: Note that if the filehandle has been marked as C<:utf8> Unicode characters are read instead of bytes (the LENGTH, OFFSET, and the return value of sysread() are in Unicode characters).
es_es: Tenga en cuenta que si el identificador de archivo ha sido marcado como C<:utf8>, son leídos caracteres Unicode en lugar de bytes (la LONGITUD, el DESPLAZAMIENTO y el valor de retorno de sysread() están descritos en forma de número de caracteres Unicode).

source: Some years ago, comp.lang.perl was divided into those groups, and comp.lang.perl itself officially removed.
es_es: Hace unos años se dividió el grupo comp.lang.perl en estos grupos y después se eliminó oficialmente.

source: In order of preference:
es_es: En orden de preferencia:

source: A problem where C<Data::Dumper> would sometimes update the iterator state of hashes has been fixed
es_es: Un problema donde C<Data::Dumper> a veces actualizaba el estado del iterador de hashes, ha sido arreglado

source: Due to the rules and rigors of ANSI C, on some systems you have to do a seek whenever you switch between reading and writing.
es_es: Debido a las normas y rigores de la norma ANSI C, en algunos sistemas tendrá que hacer una búsqueda cada vez que alterne entre la lectura y la escritura.

source: This will configure and compile perl for your platform, run the regression tests, and install perl in a subdirectory "localperl" of your home directory.
es_es: Esto configurará y compilará perl para su plataforma, ejecutará las pruebas de regresión, e instalará perl en un subdirectorio "localperl" de su directorio principal.

source: will probably work for an executable script invoked as C<scriptname>, while:
es_es: probablemente funcionará para un script ejecutable invocado como C<nombredelscript>, mientras que:

source: Building Perl on WinCE has been much enhanced, see F<README.ce> and F<README.perlce>.
es_es: La construcción de Perl en WinCE se ha mejorado mucho, vea F<README.ce> y F<README.perlce>.

source: Commonly available C<S_IF*> constants are:
es_es: Comúnmente disponibles las constantes C<S_IF*> son:

source: The F<README> file for general stuff.
es_es: El archivo F<README> (LEEME) para asuntos generales.

source: If you run into any trouble whatsoever or you need to install a customized version of Perl, you should read the detailed instructions in the "INSTALL" file that came with this distribution.
es_es: Si surge algún problema o si es necesario instalar una versión personalizada de Perl, debería leer las instrucciones detalladas en el archivo "INSTALL" que viene con esta distribución.

source: when (/oranges?/) { print "I don't like oranges."
es_es: when (/naranjas?/) { print "No me gustan las naranjas."

source: These are all documented in L<perlfunc>.
es_es: Están todas documentadas en L<perlfunc>.

source: (The C<:encoding(utf8)> layer also works the same way.)
es_es: (La capa C<:encoding(utf8)> también funciona del mismo modo.)

source: If the template in brackets contains alignment commands (such as C<x![d]>), its packed length is calculated as if the start of the template had the maximal possible alignment.
es_es: Si la plantilla que figura entre corchetes contiene los comandos de alineación (como C<x![d]>), su longitud se calculará como si el comienzo de la plantilla tuviera la máxima alineación posible.

source: For the list above LIMIT would have been 4 by default.
es_es: Para la lista de arriba LÍMITE hubiera sido 4 por defecto.

source: Finally, a reminder of an impending feature removal.
es_es: Por último, un recordatorio de una eliminación inminente.

source: EXPR is executed as a system command.
es_es: EXPR es ejecutada como un comando del sistema.

source: You can use the substr() function as an lvalue, in which case EXPR must itself be an lvalue.
es_es: Puede utilizar la función substr() como un I<ivalor>, en cuyo caso la EXPR debe ser en si mismo un I<ivalor>.

source: On systems that support fchown(2), you may pass filehandles among the files.
es_es: En sistemas que soporten fchown(2), puede pasar identificadores de archivo entre los archivos.

source: (contributed by brian d foy)
es_es: (contribución de brian d foy)

source: If you want to use C<alarm> to time out a system call you need to use an C<eval>/C<die> pair.
es_es: Si quiere usar C<alarm> controlar la duración de una llamada del sistema necesita una pareja C<eval>/C<die>.

source: The resulting object code and the C<perl> binary may well be smaller than 5.8.7, in particular due to a change contributed by Dave Mitchell which reworked the warnings code to be significantly smaller.
es_es: El código objeto resultante y el C<perl> binario pueden ser menores que 5.8.7, en particular, debido a un cambio aportado por Dave Mitchell, que rehízo el código de las advertencias para que fuera significativamente menor.

source: $scalar = delete $hash{foo}; # $scalar is 11
es_es: $scalar = delete $hash{foo}; # $scalar es 11

source: dumpValue $prettily @_;
es_es: dumpValue $bellamente @_;

source: my $db = tie(%hash, 'SDBM_File', $filename, O_RDWR|O_CREAT, 0640)
es_es: my $db = tie(%hash, 'SDBM_File', $archivo, O_RDWR|O_CREAT, 0640)

source: ISBN 0-201-61571-1 [1st edition 2001]
es_es: ISBN 0-201-61571-1 [1ª edición - 2001]

source: See L<perlsub/"Localized deletion of elements of composite types">.
es_es: Ver L<perlsub/"Eliminación local de elementos de tipos compuestos">.

source: my @compiled = map qr/$_/i, @$patterns;
es_es: my @compilados = map qr/$_/i, @$patrones;

source: There's also a negated version of it:
es_es: También existe la versión negada:

source: These are available only if you enable the C<"switch"> feature.
es_es: Estas están disponibles solo si activa la característica C<"switch">.

source: In place sort optimised (eg C<@a = sort @a>)
es_es: Optimizado sort ejecutado sobre la misma variable (ej.: C<@a = sort @a>)

source: when (/x/) { say '$foo contains an x'; continue }
es_es: when (/x/) { say '$foo contiene una x'; continue }

source: Using C<delete> on an array no longer leaks memory.
es_es: El uso de C<delete> en un array ya no provoca fugas de memoria.

source: The C<@addrs> value returned by a successful call is a list of raw addresses returned by the corresponding library call.
es_es: El valor devuelto C<@addrs> por una exitosa llamada es una lista de las direcciones en crudo devueltas por la correspondiente llamada a la biblioteca.

source: It is an error to refer to a name not defined by a C<< (?<NAME>) >> earlier in the pattern.
es_es: Es un error referirse a un nombre no definido anteriormente en el patrón por un C<< (?<NOMBRE>) >>.

source: If EXPR is omitted, uses C<$_>.
es_es: Si se omite EXPR, se usa C<$_>.

source: There may also be information at F<http://www.perl.com/>, the Perl Home Page.
es_es: También puede haber información en F<http://www.perl.com/>, la página oficial de Perl.

source: See the C-comment deletion code in L<perlop>.
es_es: Vea el código en C para eliminar comentarios en L<perlop>.

source: It is useful syntactically for separating a function name from a parenthesized expression that would otherwise be interpreted as the complete list of function arguments.
es_es: Es útil para separar sintácticamente un nombre de función de una expresión entre paréntesis que, de otro modo, sería interpretada como la lista completa de argumentos de la función.

source: For example, C<time+86_400> always means C<time() + 86_400>.
es_es: Por ejemplo, C<time+86_400> siempre significa C<time() + 86_400>.
